{
    "schema_version": "1.3.0",
    "display": {
        "id": "phase_2.5",
        "title": "Phase 2.5: Defined Relationship Check-In",
        "short_title": "Stability Check",
        "description": "A recyclable check-in for defined couples to stabilize expectations, repair patterns, and keep the relationship healthy after DTR.",
        "icon": "💚",
        "menu_icon": "≈",
        "order": 3
    },
    "artifact": {
        "id": "phase_2.5_defined_relationship_checkin",
        "title": "Defined Relationship Check-In",
        "subtitle": "A structured space to keep your defined relationship stable, honest, and continuously improving.",
        "language": "en-US",
        "stage": {
            "code": "phase_2.5",
            "label": "Post-DTR Stabilization",
            "eligibility": [
                "You have defined the relationship (exclusive and/or labeled).",
                "You want to stabilize expectations now that the stakes are higher.",
                "You want a repeatable check-in cadence (monthly, quarterly, or after major stressors).",
                "You want to address small issues before they become resentments."
            ]
        },
        "purpose": [
            "Translate commitment into a workable day-to-day operating system.",
            "Spot drift early: expectations, effort, boundaries, communication, or emotional safety.",
            "Strengthen repair: how you handle stress, rupture, and reconnection.",
            "Keep closeness intentional without relying on mind-reading or guesswork.",
            "Build a repeatable maintenance rhythm that prevents preventable damage."
        ]
    },
    "intro": {
        "instructions": {
            "title": "How to Use This",
            "items": [
                "Do this individually first, then share and discuss (unless you both agree to complete it together live).",
                "Answer from lived reality this month, not from hope, fear, or how you want to be perceived.",
                "Treat surprises as data, not betrayal. Curiosity first, defensiveness later (if at all).",
                "If a topic escalates, pause, regulate, then return. This works best when you're both resourced.",
                "Repeat this regularly. Maintenance is not a sign of weakness; it is how stability is built."
            ]
        },
        "keep_in_mind": {
            "title": "A Few Truths Worth Remembering",
            "items": [
                "Defined relationships raise the emotional cost of ambiguity. Clarity becomes kindness.",
                "Unmet needs are not proof of failure; they're signals to adjust the system.",
                "Consistency matters more than intensity. Small, reliable effort beats grand gestures.",
                "Repair is the skill that predicts long-term health more than chemistry does.",
                "If safety concerns show up (control, threats, coercion, violence), stop and seek real-world support."
            ]
        }
    },
    "prompts_artifact": {
        "id": "phase_2.5_prompts",
        "title": "Phase 2.5: Defined Relationship Reflection Prompts",
        "language": "en-US",
        "applies_to": "phase_2.5_defined_relationship_checkin"
    },
    "privacy_preface": {
        "title": "Privacy & Sharing Notes",
        "text": "Your answers are private until you choose to share them. If you use an AI to reflect on your responses, only paste what you both consent to share. Redact names and identifying details. This tool offers reflection and structure, not therapy or diagnosis. If your answers surface harm, coercion, stalking, threats, or violence, pause and seek real-world support now (US: call/text 988; if you are in immediate danger call your local emergency number)."
    }
}